app/controllers/scores_controller.rb

  def create
    @score = Score.new(score_params)

    respond_to do |format|
      if @score.save
---
INSERT INTO "scores" ("subject", "point", "grade", "student_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["subject", "Ruby"], ["point", 80], ["grade", "A"], ["student_id", 1], ["created_at", "2022-09-29 08:54:02.721417"], ["updated_at", "2022-09-29 08:54:02.721417"]]

  def destroy
    @score.destroy
---
DELETE FROM "scores" WHERE "scores"."id" = ?  [["id", 1]]